//
//  bio.swift
//  trianthropotypesPaschalides
//
//  Created by Angelos Staboulis on 7/6/23.
//

import SwiftUI

struct bio: View {
    init() {
        UITableView.appearance().contentInset.top = -20
        UITableView.appearance().backgroundColor = .clear
        UITableView.appearance().layer.backgroundColor = UIColor.clear.cgColor
    }
    @State var bio =
    """
    Ο Γιώργος Πασχαλίδης είναι ΑκαδημαΪκός, καθηγητής Ψυχολογίας και Αντιπρύτανης της Ρωσικής Ακαδημίας Νοοσφαιρικής Εκπαίδευσης. Έλαβε το Διδακτορικό του Δίπλωμα (Ph.D.) στην Ψυχολογία τον Ιανουάριο του 2016, και είναι Πρύτανης του παραρτήματος της Ακαδημίας Νοοσφαιρικής Εκπαίδευσης στην Ελλάδα. Είναι επίσης μέλος του Διοικητικού Συμβουλίου του Συνδέσμου Αεροδιαστημικής, Ναυτικής, Περιβαλλοντικής Ιατρικής και Ιατρικής Ακραίων Συνθηκών της Ρωσίας.
    Είναι γεννημένος το 1957 και μεγαλωμένος στο Αιγίνιο της Πιερίας από αγροτική οικογένεια. Είναι παντρεμένος με την Χρυσούλα και πατέρας δύο παιδιών. Η δραστηριότητά του και το ερευνητικό του έργο ξεκινά στα τέλη του 2000 και οι πρώτες ανακοινώσεις του δημοσιεύσεις και βραβεύσεις έρχονται το 2010 που αφορούν τη λειτουργία του ανθρώπινου εγκεφάλου και του σώματος. Ακρογωνιαίο λίθο του έργου του αποτέλεσε η μοναδική ανακάλυψη του Mοντέλου Tri-Anthropo-Type Paschalidis, καρπός και επιστέγασμα των δώδεκα χρόνων διαρκούς και εντατικής έρευνας, μελέτης και παρατήρησης, και εν συνεχεία οι πολλαπλές εφαρμογές του Μοντέλου στην Ιατρική, την Εκπαίδευση, τον Αθλητισμό, την Ψυχολογία, την Διοίκηση επιχειρήσεων.
    Το 2010 βραβεύεται με το ΙX (9ο) Διεθνές Βραβείο «Giuseppe Sciacca» του Πανεπιστημίου του Βατικανού (Pontificia Universita Urbaniana) και το 2012 βραβεύεται από τον Όμιλο για την UNESCO Τεχνών, Λόγου και Επιστημών Ελλάδος. Το 2015 γίνεται μέλος του Συνδέσμου Αεροδιαστημικής, Ναυτικής, Περιβαλλοντικής Ιατρικής και Ιατρικής Ακραίων Συνθηκών της Ρωσίας και το 2016 του απονέμεται ο τίτλος του Διδάκτορα Ψυχολογίας από την Ακαδημία Νοοσφαιρικής Εκπαίδευσης και συγχρόνως τον τιμούν με την θέση του Αντιπρύτανη στην ανωτέρω Ακαδημία.
    Το 2016 του δόθηκε το Δίπλωμα του συνεργάτη από το τμήμα Φυσικής αγωγής και Φυσιοθεραπείας του Πολυτεχνείου Opole. Το 2017 του απονέμεται το παράσημο «Vladimir Vernadsky II» για τη συνεισφορά του, με τα επιστημονικά επιτεύγματά του, στον τομέα της Ψυχολογίας και της Ιατρικής.
    """
    var body: some View {
        VStack{
            Image(.bg).resizable().overlay {
                VStack{
                    Text("Biography")
                        .frame(width: 350, height: 50, alignment: .center)
                        .foregroundColor(.blue)
                        .padding(-40.0)
                        .font(Font(CTFont(.label, size: 20)))
                    ScrollView(.vertical){
                        Text(bio)
                            .frame(width: 350, height: 290, alignment: .center)
                            .foregroundColor(.blue)
                            .padding(50.0)
                            .font(Font(CTFont(.label, size: 12.0)))
                    }
                    Spacer()
                    
                }.frame(height:670,alignment:.top)
               
            }
            Spacer()
        }.frame(height:990,alignment:.top)
    }
}

struct bio_Previews: PreviewProvider {
    static var previews: some View {
        bio()
    }
}
